OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  DBUGF("Divert Mode: %d", divertmode);
}

// -------------------------------------------------------------------
// Change current shaper mode 0:disable (default), 1:Enable
// url: /shaper
// -------------------------------------------------------------------
void
handleCurrentShaper(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }
  shaper.setState(request->getParam("shaper").toInt() == 1? true: false);

  response->setCode(200);
  response->print("Current Shaper state changed");
  request->send(response);

  DBUGF("CurrentShaper: %d", shaper.getState());
}

// -------------------------------------------------------------------
// Manually set the time
// url: /settime
// -------------------------------------------------------------------
void handleSetTime(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  handleTimePost(request, response);

  request->send(response);
}

// -------------------------------------------------------------------
// Get Tesla Vehicle Info
// url: /teslaveh
// -------------------------------------------------------------------
void
handleTeslaVeh(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  StaticJsonDocument<1024> doc;
  int count = teslaClient.getVehicleCnt();
  doc["count"] = count;
  JsonArray vehicles = doc.createNestedArray("vehicles");

  for (int i = 0; i < count; i++)
  {
    JsonObject vehicle = vehicles.createNestedObject();
    vehicle["id"] = teslaClient.getVehicleId(i);
    vehicle["name"] = teslaClient.getVehicleDisplayName(i);
  }

  response->setCode(200);
  serializeJson(doc, *response);
  request->send(response);
}

// -------------------------------------------------------------------
// Returns status json
// url: /status
// -------------------------------------------------------------------
void handleStatusPost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();
  // Deserialize the JSON document
  const size_t capacity = JSON_OBJECT_SIZE(32) + 1024;
  DynamicJsonDocument doc(capacity);
  DeserializationError error = deserializeJson(doc, body);
  if(!error)
  {
    bool send_event = true;

    if(doc.containsKey("voltage"))
    {
      double volts = doc["voltage"];
      DBUGF("voltage:%.1f", volts);
      evse.setVoltage(volts);
    }
    // NOTE: these solar/grid/live-power pushes intentionally bypass the
    // divert_data_src/shaper_data_src arbitration. An explicit POST is a deliberate
    // override by the caller (unlike the MQTT background source, which is muted when
    // the feed is HA-sourced). There is no DATA_SRC_HTTP for these feeds, by design.
    if(doc.containsKey("shaper_live_pwr"))
    {
      double shaper_live_pwr = doc["shaper_live_pwr"];
      shaper.setLivePwr(shaper_live_pwr);
      DBUGF("shaper: live power:%dW", shaper.getLivePwr());
    }
    if(doc.containsKey("solar")) {
      solar = doc["solar"];
      DBUGF("solar:%dW", solar);
      divert.update_state();
      // recalculate shaper
      if (shaper.getState()) {
        shaper.shapeCurrent();
      }
      send_event = false; // Divert sends the event so no need to send here
    }
    else if(doc.containsKey("grid_ie")) {
      grid_ie = doc["grid_ie"];
      DBUGF("grid:%dW", grid_ie);
      divert.update_state();
      // recalculate shaper
      if (shaper.getState()) {
        shaper.shapeCurrent();
      }
      send_event = false; // Divert sends the event so no need to send here
    }
    if(doc.containsKey("battery_level") && vehicle_data_src == VEHICLE_DATA_SRC_HTTP) {
      double vehicle_soc = doc["battery_level"];
      DBUGF("vehicle_soc:%d%%", vehicle_soc);
      evse.setVehicleStateOfCharge(vehicle_soc);
      doc["vehicle_state_update"] = 0;
    }
    if(doc.containsKey("battery_range") && vehicle_data_src == VEHICLE_DATA_SRC_HTTP) {
      double vehicle_range = doc["battery_range"];
      DBUGF("vehicle_range:%dKM", vehicle_range);
      evse.setVehicleRange(vehicle_range);
      doc["vehicle_state_update"] = 0;
    }
    if(doc.containsKey("time_to_full_charge") && vehicle_data_src == VEHICLE_DATA_SRC_HTTP){
      double vehicle_eta = doc["time_to_full_charge"];
      DBUGF("vehicle_eta:%d", vehicle_eta);
      evse.setVehicleEta(vehicle_eta);
      doc["vehicle_state_update"] = 0;
    }
    // send back new value to clients
    if(send_event) {
      event_send(doc);
    }
    response->setCode(200);
    serializeJson(doc, *response);
  } else {
    response->setCode(400);
    response->print("{\"msg\":\"Could not parse JSON\"}");
  }
}


void
handleStatus(MongooseHttpServerRequest *request)
{

  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  if(HTTP_GET == request->method()) {

    const size_t capacity = JSON_OBJECT_SIZE(128) + 2048;
    DynamicJsonDocument doc(capacity);
    buildStatus(doc);
    response->setCode(200);
    serializeJson(doc, *response);

  } else if(HTTP_POST == request->method()) {
    handleStatusPost(request, response);
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}

// -------------------------------------------------------------------
//
// url: /schedule
// -------------------------------------------------------------------
void
handleScheduleGet(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response, uint16_t event)
{
  const size_t capacity = JSON_OBJECT_SIZE(40) + 1024;
  DynamicJsonDocument doc(capacity);

  bool success = (SCHEDULER_EVENT_NULL == event) ?
    scheduler.serialize(doc) :
    scheduler.serialize(doc, event);

  if(success) {
    response->setCode(200);
    serializeJson(doc, *response);
  } else {
    response->setCode(404);
    response->print("{\"msg\":\"Not found\"}");
  }
}

void
handleSchedulePost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response, uint16_t event)
{
  String body = request->body().toString();

