OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  bool success = (SCHEDULER_EVENT_NULL == event) ?
    scheduler.deserialize(body) :
    scheduler.deserialize(body, event);

  if(success) {
    response->setCode(200);
    response->print("{\"msg\":\"done\"}");
  } else {
    response->setCode(400);
    response->print("{\"msg\":\"Could not parse JSON\"}");
  }
}

void
handleScheduleDelete(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response, uint16_t event)
{
  if(SCHEDULER_EVENT_NULL != event)
  {
    if(scheduler.removeEvent(event)) {
      response->setCode(200);
      response->print("{\"msg\":\"done\"}");
    } else {
      response->setCode(404);
      response->print("{\"msg\":\"Not found\"}");
    }
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }
}

#define SCHEDULE_PATH_LEN (sizeof("/schedule/") - 1)

void
handleSchedule(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  uint16_t event = SCHEDULER_EVENT_NULL;

  String path = request->uri();
  if(path.length() > SCHEDULE_PATH_LEN) {
    String eventStr = path.substring(SCHEDULE_PATH_LEN);
    DBUGVAR(eventStr);
    event = eventStr.toInt();
  }

  DBUGVAR(event);

  if(HTTP_GET == request->method()) {
    handleScheduleGet(request, response, event);
  } else if(HTTP_POST == request->method()) {
    handleSchedulePost(request, response, event);
  } else if(HTTP_DELETE == request->method()) {
    handleScheduleDelete(request, response, event);
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}

void
handleSchedulePlan(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  const size_t capacity = JSON_OBJECT_SIZE(40) + 2048;
  DynamicJsonDocument doc(capacity);

  scheduler.serializePlan(doc);
  response->setCode(200);
  serializeJson(doc, *response);

  request->send(response);
}

//----------------------------------------------------------
//
//            Limit
//
//----------------------------------------------------------

void handleLimitGet(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(limit.hasLimit())
  {
    limit.get().serialize(response);
  } else {
    response->setCode(200);
    response->print("{}");
  }
}

void handleLimitPost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();

    if (limit.set(body)) {
      response->setCode(201);
      response->print("{\"msg\":\"done\"}");
    } else {
      // unused for now
      response->setCode(400);
      response->print("{\"msg\":\"failed to parse JSON\"}");
    }
}

void handleLimitDelete(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(limit.hasLimit()) {
    if (limit.clear()) {
      response->setCode(200);
      response->print("{\"msg\":\"done\"}");
    } else {
      response->setCode(500);
      response->print("{\"msg\":\"failed\"}");
    }
  } else {
    response->setCode(200);
    response->print("{\"msg\":\"no limit\"}");
  }
}

void handleLimit(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  if(HTTP_GET == request->method()) {
    handleLimitGet(request, response);
  } else if(HTTP_POST == request->method()) {
    handleLimitPost(request, response);
  } else if(HTTP_DELETE == request->method()) {
    handleLimitDelete(request, response);
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}

//----------------------------------------------------------
//
//            Energy Meter
//
//----------------------------------------------------------
void handleEmeterDelete(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();
  DynamicJsonDocument doc(512);
  DeserializationError err = deserializeJson(doc, body);
  if (DeserializationError::Code::Ok == err) {
    if (doc.containsKey("hard") && doc.containsKey("import")) {
      bool hardreset = (bool)doc["hard"];
      bool import = (bool)doc["import"];
      if (evse.resetEnergyMeter(hardreset,import)) {
        response->setCode(200);
        response->print("{\"msg\":\"Reset done\"}");
      }
      else {
        response->setCode(500);
        response->print("{\"msg\":\"Reset failed\"}");
      }

    }
    else {
      response->setCode(500);
      response->print("{\"msg\":\"Reset Failed\"}");
    }
  }
  else {
    response->setCode(500);
    response->print("{\"msg\":\"reset Failed\"}");
  }
}

void handleEmeter(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if (false == requestPreProcess(request, response))
  {
    return;
  }

  if (HTTP_DELETE == request->method())
  {
    handleEmeterDelete(request, response);
  }
  else
  {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }

  request->send(response);
}



  //----------------------------------------------------------

  void handleOverrideGet(MongooseHttpServerRequest * request, MongooseHttpServerResponseStream * response)
  {
    if (manual.isActive())
    {
      EvseProperties props;
      manual.getProperties(props);
      props.serialize(response);
    } else {
    response->setCode(200);
    response->print("{}");
  }
}

void handleOverridePost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  String body = request->body().toString();

  EvseProperties props;
  if(props.deserialize(body))
  {
    if(manual.claim(props)) {
      response->setCode(201);
      response->print("{\"msg\":\"Created\"}");
      mqtt.publishOverride();  // update override state to mqtt
    } else {
      response->setCode(500);
      response->print("{\"msg\":\"Failed to claim manual override\"}");
    }
  } else {
    response->setCode(400);
    response->print("{\"msg\":\"Failed to parse JSON\"}");
  }
}

void handleOverrideDelete(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(manual.release()) {
    response->setCode(200);
    response->print("{\"msg\":\"Deleted\"}");
    mqtt.publishOverride();  // update override state to mqtt
  } else {
    response->setCode(500);
    response->print("{\"msg\":\"Failed to release manual override\"}");
  }
}

void handleOverridePatch(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response)
{
  if(manual.toggle())
  {
    response->setCode(200);
    response->print("{\"msg\":\"Updated\"}");
    mqtt.publishOverride();  // update override state to mqtt
  } else {
    response->setCode(500);
    response->print("{\"msg\":\"Failed to toggle manual override\"}");
  }
}

void
handleOverride(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

