OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
void handleNotFound(MongooseHttpServerRequest *request)
{
  // Not a dynamic handler, check the static resources
  if(web_static_handle(request)) {
    return;
  }

  DBUG("NOT_FOUND: ");
  dumpRequest(request);

  if(net.isWifiModeAp()) {
    // Redirect to the home page in AP mode (for the captive portal)
    MongooseHttpServerResponseStream *response = request->beginResponseStream();
    response->setContentType(CONTENT_TYPE_HTML);

    String url = F("http://");
    url += net.getIp();

    String s = F("<html>");
    s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
    s += url;
    s += F("\" /></head><body><a href=\"");
    s += url;
    s += F("\">OpenEVSE</a></body></html>");

    response->setCode(301);
    response->addHeader(F("Location"), url);
    response->print(s);
    request->send(response);
  } else {
    request->send(404);
  }
}

void handleHttpsRedirect(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response = request->beginResponseStream();
  response->setContentType(CONTENT_TYPE_HTML);

  String url = F("https://");
  url += request->host().toString();
  url += request->uri().toString();

  String s = F("<html>");
  s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
  s += url;
  s += F("\" /></head><body><a href=\"");
  s += url;
  s += F("\">OpenEVSE</a></body></html>");

  response->setCode(301);
  response->addHeader(F("Location"), url);
  response->print(s);
  request->send(response);
}

void onWsFrame(MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len)
{
  DBUGF("Got message %.*s", len, (const char *)data);
  const size_t capacity = JSON_OBJECT_SIZE(1) + 16;
  DynamicJsonDocument doc(capacity);
  DeserializationError error = deserializeJson(doc, data, len);
  if (!error) {
    if (doc.containsKey("ping") && doc["ping"].is<int8_t>())
      {
        // answer pong
        connection->send("{\"pong\": 1}");

      }
  }
}

void onWsConnect(MongooseHttpWebSocketConnection *connection)
{
  DBUGF("New client connected over ws");
  // pushing states to client
  // headroom for the HA display-only fields (home_battery_soc/power,
  // vehicle_plugged/charging_state) appended at the end of buildStatus().
  const size_t capacity = JSON_OBJECT_SIZE(48) + 1024;
  DynamicJsonDocument doc(capacity);
  buildStatus(doc);
  web_server_event(doc);
}

/*
 * Really simple 'conversion' of ASCII to UTF-8, basically only a few places send >127 chars
 * so just filter those to be acceptable as UTF-8
 */
void web_server_send_ascii_utf8(const char *endpoint, const uint8_t *buffer, size_t size)
{
  char temp[size];
  for(int i = 0; i < size; i++) {
    temp[i] = buffer[i] & 0x7f;
  }
  server.sendAll(endpoint, WEBSOCKET_OP_TEXT, temp, size);
}

#ifdef FAKE_EVSE
static void handleFakeEvse(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  FakeEvseState &st = fakeEvseStream.state;

  if(HTTP_GET == request->method()) {
    // fall through to build the state response below
  } else if(HTTP_POST == request->method()) {
    String body = request->body().toString();
    const size_t req_capacity = JSON_OBJECT_SIZE(8) + 128;
    DynamicJsonDocument in(req_capacity);
    DeserializationError err = deserializeJson(in, body);
    if(!err) {
      if(in.containsKey("vehicle")) st.set_vehicle(in["vehicle"].as<bool>());
      if(in.containsKey("fault"))   st.fault = in["fault"].as<const char *>();  // unknown string => "no fault" per state()
      if(in.containsKey("voltage")) st.voltage_mv = (long)(in["voltage"].as<double>() * 1000.0);
      if(in.containsKey("current")) {
        // Set delivered amps directly, and lift capacity so the firmware's next
        // $SC (clamped to max_cfg_a) won't pull it back down. Bench knob only.
        long a = in["current"].as<long>();
        if(a < st.min_a) a = st.min_a;
        if(a > 80)       a = 80;                       // sane bench ceiling
        if(a > st.max_hw_a)  st.max_hw_a  = a;
        if(a > st.max_cfg_a) st.max_cfg_a = a;
        st.pilot_a = a;
      }
    } else {
      response->setCode(400);
      response->print("{\"msg\":\"Could not parse JSON\"}");
      request->send(response);
      return;
    }
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
    request->send(response);
    return;
  }

  const size_t resp_capacity = JSON_OBJECT_SIZE(12) + 128;
  DynamicJsonDocument doc(resp_capacity);
  doc["state"]            = st.state();
  doc["pilot"]            = st.pilot_a;
  doc["max_current"]      = st.max_cfg_a;
  doc["amps"]             = st.charge_ma() / 1000.0;
  doc["volts"]            = st.voltage_mv / 1000.0;
  doc["session_elapsed"]  = st.session_elapsed_s;
  doc["session_wh"]       = st.session_wh;
  doc["total_kwh"]        = st.total_wh / 1000.0;
  doc["vehicle"]          = st.vehicle_present;
  doc["charging_allowed"] = st.charging_allowed;
  doc["fault"]            = st.fault;
  response->setCode(200);
  serializeJson(doc, *response);
  request->send(response);
}
#endif // FAKE_EVSE

void web_server_setup()
{
  bool use_ssl = false;
  if(www_certificate_id != "")
  {
    uint64_t cert_id = std::stoull(www_certificate_id.c_str(), nullptr, 16);
    const char *cert = certs.getCertificate(cert_id);
    const char *key = certs.getKey(cert_id);
    if(NULL != cert && NULL != key)
    {
      server.begin(443, cert, key);
      use_ssl = true;

      redirect.begin(80);
      redirect.on("/", handleHttpsRedirect);
    }
  }

  if(false == use_ssl) {
    server.begin(80);
  }

  // Handle status updates
  server.on("/status$", handleStatus);
  server.on("/config$", handleConfig);

  // Handle HTTP web interface button presses
  server.on("/teslaveh$", handleTeslaVeh);
  server.on("/tesla/vehicles$", handleTeslaVeh);
  server.on("/settime$", handleSetTime);
  server.on("/reset$", handleRst);
  server.on("/restart$", handleRestart);
  server.on("/rapi$", handleRapi);
  server.on("/r$", handleRapi);
  server.on("/scan$", handleScan);
  server.on("/apoff$", handleAPOff);
  server.on("/divertmode$", handleDivertMode);
  server.on("/shaper$", handleCurrentShaper);
  server.on("/emoncms/describe$", handleDescribe);
  server.on("/rfid/add$", handleAddRFID);

  server.on("/schedule/plan$", handleSchedulePlan);
  server.on("/schedule", handleSchedule);

  server.on("/claims/target$", handleEvseClaimsTarget);
  server.on("/claims", handleEvseClaims);

  server.on("/override$", handleOverride);

