OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  server.on("/ha/auth/start$", handleHomeAssistantAuthStart);
  server.on("/ha_callback", handleHomeAssistantCallback); // no $ anchor: matched against the path only (query stripped); HA appends ?code=&state=
  server.on("/ha/status$", handleHomeAssistantStatus);
  server.on("/ha/disconnect$", handleHomeAssistantDisconnect);

  server.on("/logs", handleEventLogs);
  server.on("/logs/export$", handleLogsExport);
  server.on("/rfid/users$", handleRfidUsers);
  server.on("/certificates", handleCertificates);
  server.on("/limit", handleLimit);
  server.on("/emeter", handleEmeter);
  server.on("/time", handleTime);

#ifndef ENABLE_TSDB
  server.on("/energy/raw$", handleEnergyRaw);
  server.on("/energy/daily$", handleEnergyDaily);
  server.on("/energy/monthly$", handleEnergyMonthly);
  server.on("/energy/annual$", handleEnergyAnnual);
#endif // !ENABLE_TSDB

  // Simple Firmware Update Form
  server.on("/update$")->
    onRequest(handleUpdateRequest)->
    onUpload(handleUpdateUpload)->
    onClose(handleUpdateClose);

  server.on("/debug$", [](MongooseHttpServerRequest *request) {
    MongooseHttpServerResponseStream *response;
    if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
      return;
    }

    response->setCode(200);
    response->setContentType(CONTENT_TYPE_TEXT);
    response->addHeader("Access-Control-Allow-Origin", "*");
    SerialDebug.printBuffer(*response);
    request->send(response);
  });

  server.on("/debug/console$")->onFrame([](MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len) {
  });

  SerialDebug.onWrite([](const uint8_t *buffer, size_t size)
  {
    server.sendAll("/debug/console", WEBSOCKET_OP_TEXT, buffer, size);
  });

  server.on("/evse$", [](MongooseHttpServerRequest *request) {
    MongooseHttpServerResponseStream *response;
    if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
      return;
    }

    response->setCode(200);
    response->setContentType(CONTENT_TYPE_TEXT);
    response->addHeader("Access-Control-Allow-Origin", "*");
    SerialEvse.printBuffer(*response);
    request->send(response);
  });

  server.on("/evse/console$")->onFrame([](MongooseHttpWebSocketConnection *connection, int flags, uint8_t *data, size_t len) {
  });

  SerialEvse.onWrite([](const uint8_t *buffer, size_t size) {
    web_server_send_ascii_utf8("/evse/console", buffer, size);
  });
  SerialEvse.onRead([](const uint8_t *buffer, size_t size) {
    web_server_send_ascii_utf8("/evse/console", buffer, size);
  });

  server.on("/ws$")->
    onFrame(onWsFrame)
    ->
    onConnect(onWsConnect);

#ifdef FAKE_EVSE
  server.on("/fakeevse$", handleFakeEvse);
#endif

  server.onNotFound(handleNotFound);

  DEBUG.println("Server started");
}

void
web_server_loop() {
  Profile_Start(web_server_loop);

  // Do we need to restart the WiFi?
  if(wifiRestartTime > 0 && millis() > wifiRestartTime) {
    wifiRestartTime = 0;
    net.wifiRestart();
  }

  // Do we need to turn off the access point?
  if(apOffTime > 0 && millis() > apOffTime) {
    apOffTime = 0;
    net.wifiTurnOffAp();
  }

  Profile_End(web_server_loop, 5);
}

void web_server_event(JsonDocument &event)
{
  String json;
  serializeJson(event, json);
  server.sendAll("/ws", json);
}
